Revit 2024 API
InCanvasControlData Members
The InCanvasControlData type exposes the following members.
Constructors
Name | Description
InCanvasControlData(String)
 Constructs an InCanvasControlData with specific values assigned.
InCanvasControlData(String, XYZ)
 Constructs an InCanvasControlData with specific values assigned.
Methods
Name | Description
Dispose
Releases all resources used by the InCanvasControlData
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
ImagePath
 The path to the image file to be used. This must be an absolute path to a location on disk.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Position
 The position of the in-canvas control in model coordinates.
See Also
InCanvasControlData Class
Autodesk.Revit.DB Namespace